# Taps
tap "lemoony/tap"

# Formulaes
brew "black"
brew "clang-format"
brew "cmake"
brew "ctags"
brew "doxygen"
brew "htop"
brew "ksdiff"
brew "lemoony/tap/snipkit"
brew "mas"
brew "neofetch"
brew "ninja"
brew "nmap"
brew "python3"
brew "sphinx-doc"
brew "shfmt"
brew "swig"
brew "tmux"
brew "tree"
brew "wget"

# Casks
cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "dash"
cask "discord"
cask "gitup"
cask "gpg-suite-no-mail"
cask "kaleidoscope"
cask "nova"
cask "numi"
cask "secretive"
cask "sublime-text"
cask "tower"

# MacAppStore
mas "Step Two", id: 1448916662 # Usually amongst the first app needed after install
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "Apple Developer", id: 640199958
mas "Apple Remote Desktop", id: 409907375
mas "DaisyDisk", id: 411643860
mas "Day One", id: 1055511498
mas "Deliveries", id: 290986013
mas "HextEdit", id: 1557247094
mas "iNet Network Scanner", id: 403304796
mas "Jayson", id: 1468691718
mas "Keynote", id: 409183694
mas "Mactracker", id: 430255202
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Quip", id: 1003160018
mas "Slack", id: 803453959
mas "SnippetsLab", id: 1006087419
mas "Speedtest by Ookla", id: 1153157709
mas "Textual 7", id: 1262957439
mas "Twitter", id: 1482454543

# Apple Related
tap "apple/applejack"
tap "apple/device-compute"
brew "apple/device-compute/apple-devicecompute"
cask "apple-vessel"
