# Formulaes
brew "1password-cli"
brew "clang-format"
brew "cmake"
brew "ctags"
brew "doxygen"
brew "htop"
brew "lemoony/tap/snipkit"
brew "mas"
brew "neofetch"
brew "ninja"
brew "nmap"
brew "python3"
brew "sphinx-doc"
brew "swig"
brew "tmux"
brew "tree"
brew "wget"

# Casks
cask "1password"
cask "appcleaner"
cask "dash"
cask "discord"
cask "gitup"
cask "gpg-suite-no-mail"
cask "numi"
cask "sublime-text"
cask "tower"

# MacAppStore
mas "Step Two" # Usually amongst the first app needed after install
mas "Amphetamine"
mas "Apple Configurator"
mas "Apple Developer"
mas "Apple Remote Desktop"
mas "DaisyDisk"
mas "Day One"
mas "Deliveries 3"
mas "HexEdit"
mas "Keynotes"
mas "Lexi"
mas "Mactracker"
mas "Magnet"
mas "Numbers"
mas "Pages"
mas "Pixelmator Pro"
mas "Quip"
mas "Slack"
mas "Speedtest by Ookla"
mas "Textual 7"
mas "Twitter"
mas "Xcode"
mas "iNet Network Scanner"

# Apple Related
tap "apple/applejack"
tap "apple/device-compute"
brew "apple/device-compute/apple-devicecompute"
cask "apple-vessel"
